Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/include/component/pfw.h
/**
 * \brief Component description for PFW
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-07-31T00:50:56Z */
#ifndef _BZ25_PFW_COMPONENT_H_
#define _BZ25_PFW_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PFW                                          */
/* ************************************************************************** */

/* -------- PFW_IFT_CON : (PFW Offset: 0x00) (R/W 32)  -------- */
#define PFW_IFT_CON_RESETVALUE                _U_(0x00)                                            /**<  (PFW_IFT_CON)   Reset Value */

#define PFW_IFT_CON_FRZ_Pos                   _U_(13)                                              /**< (PFW_IFT_CON)  Position */
#define PFW_IFT_CON_FRZ_Msk                   (_U_(0x1) << PFW_IFT_CON_FRZ_Pos)                    /**< (PFW_IFT_CON)  Mask */
#define PFW_IFT_CON_FRZ(value)                (PFW_IFT_CON_FRZ_Msk & ((value) << PFW_IFT_CON_FRZ_Pos))
#define PFW_IFT_CON_SIDL_Pos                  _U_(14)                                              /**< (PFW_IFT_CON)  Position */
#define PFW_IFT_CON_SIDL_Msk                  (_U_(0x1) << PFW_IFT_CON_SIDL_Pos)                   /**< (PFW_IFT_CON)  Mask */
#define PFW_IFT_CON_SIDL(value)               (PFW_IFT_CON_SIDL_Msk & ((value) << PFW_IFT_CON_SIDL_Pos))
#define PFW_IFT_CON_ON_Pos                    _U_(15)                                              /**< (PFW_IFT_CON)  Position */
#define PFW_IFT_CON_ON_Msk                    (_U_(0x1) << PFW_IFT_CON_ON_Pos)                     /**< (PFW_IFT_CON)  Mask */
#define PFW_IFT_CON_ON(value)                 (PFW_IFT_CON_ON_Msk & ((value) << PFW_IFT_CON_ON_Pos))
#define PFW_IFT_CON_Msk                       _U_(0x0000E000)                                      /**< (PFW_IFT_CON) Register Mask  */


/* -------- PFW_IFT_CRCCON : (PFW Offset: 0x04) (R/W 32)  -------- */
#define PFW_IFT_CRCCON_RESETVALUE             _U_(0x00)                                            /**<  (PFW_IFT_CRCCON)   Reset Value */

#define PFW_IFT_CRCCON_AUTOR_Pos              _U_(0)                                               /**< (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_AUTOR_Msk              (_U_(0x1) << PFW_IFT_CRCCON_AUTOR_Pos)               /**< (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_AUTOR(value)           (PFW_IFT_CRCCON_AUTOR_Msk & ((value) << PFW_IFT_CRCCON_AUTOR_Pos))
#define PFW_IFT_CRCCON_RBITO_Pos              _U_(1)                                               /**< (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_RBITO_Msk              (_U_(0x1) << PFW_IFT_CRCCON_RBITO_Pos)               /**< (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_RBITO(value)           (PFW_IFT_CRCCON_RBITO_Msk & ((value) << PFW_IFT_CRCCON_RBITO_Pos))
#define PFW_IFT_CRCCON_PAUSE_Pos              _U_(2)                                               /**< (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_PAUSE_Msk              (_U_(0x1) << PFW_IFT_CRCCON_PAUSE_Pos)               /**< (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_PAUSE(value)           (PFW_IFT_CRCCON_PAUSE_Msk & ((value) << PFW_IFT_CRCCON_PAUSE_Pos))
#define PFW_IFT_CRCCON_PLEN32_Pos             _U_(12)                                              /**< (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_PLEN32_Msk             (_U_(0x1) << PFW_IFT_CRCCON_PLEN32_Pos)              /**< (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_PLEN32(value)          (PFW_IFT_CRCCON_PLEN32_Msk & ((value) << PFW_IFT_CRCCON_PLEN32_Pos))
#define PFW_IFT_CRCCON_ERROR_Pos              _U_(13)                                              /**< (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_ERROR_Msk              (_U_(0x1) << PFW_IFT_CRCCON_ERROR_Pos)               /**< (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_ERROR(value)           (PFW_IFT_CRCCON_ERROR_Msk & ((value) << PFW_IFT_CRCCON_ERROR_Pos))
#define PFW_IFT_CRCCON_DONE_Pos               _U_(14)                                              /**< (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_DONE_Msk               (_U_(0x1) << PFW_IFT_CRCCON_DONE_Pos)                /**< (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_DONE(value)            (PFW_IFT_CRCCON_DONE_Msk & ((value) << PFW_IFT_CRCCON_DONE_Pos))
#define PFW_IFT_CRCCON_CRCEN_Pos              _U_(15)                                              /**< (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_CRCEN_Msk              (_U_(0x1) << PFW_IFT_CRCCON_CRCEN_Pos)               /**< (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_CRCEN(value)           (PFW_IFT_CRCCON_CRCEN_Msk & ((value) << PFW_IFT_CRCCON_CRCEN_Pos))
#define PFW_IFT_CRCCON_PERIOD_Pos             _U_(16)                                              /**< (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_PERIOD_Msk             (_U_(0xFFFF) << PFW_IFT_CRCCON_PERIOD_Pos)           /**< (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_PERIOD(value)          (PFW_IFT_CRCCON_PERIOD_Msk & ((value) << PFW_IFT_CRCCON_PERIOD_Pos))
#define PFW_IFT_CRCCON_Msk                    _U_(0xFFFFF007)                                      /**< (PFW_IFT_CRCCON) Register Mask  */

#define PFW_IFT_CRCCON_PLEN_Pos               _U_(12)                                              /**< (PFW_IFT_CRCCON Position)  */
#define PFW_IFT_CRCCON_PLEN_Msk               (_U_(0x1) << PFW_IFT_CRCCON_PLEN_Pos)                /**< (PFW_IFT_CRCCON Mask) PLEN */
#define PFW_IFT_CRCCON_PLEN(value)            (PFW_IFT_CRCCON_PLEN_Msk & ((value) << PFW_IFT_CRCCON_PLEN_Pos)) 

/* -------- PFW_IFT_CRCMADR : (PFW Offset: 0x08) (R/W 32)  -------- */
#define PFW_IFT_CRCMADR_RESETVALUE            _U_(0x00)                                            /**<  (PFW_IFT_CRCMADR)   Reset Value */

