Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/include/component/pfw.h
#define PFW_IFT_CRCMADR_IFT_CRCMADR_Pos       _U_(0)                                               /**< (PFW_IFT_CRCMADR)  Position */
#define PFW_IFT_CRCMADR_IFT_CRCMADR_Msk       (_U_(0xFFFFFFFF) << PFW_IFT_CRCMADR_IFT_CRCMADR_Pos) /**< (PFW_IFT_CRCMADR)  Mask */
#define PFW_IFT_CRCMADR_IFT_CRCMADR(value)    (PFW_IFT_CRCMADR_IFT_CRCMADR_Msk & ((value) << PFW_IFT_CRCMADR_IFT_CRCMADR_Pos))
#define PFW_IFT_CRCMADR_Msk                   _U_(0xFFFFFFFF)                                      /**< (PFW_IFT_CRCMADR) Register Mask  */


/* -------- PFW_IFT_CRCMLEN : (PFW Offset: 0x0C) (R/W 32)  -------- */
#define PFW_IFT_CRCMLEN_RESETVALUE            _U_(0x00)                                            /**<  (PFW_IFT_CRCMLEN)   Reset Value */

#define PFW_IFT_CRCMLEN_CRCMLEN_Pos           _U_(0)                                               /**< (PFW_IFT_CRCMLEN)  Position */
#define PFW_IFT_CRCMLEN_CRCMLEN_Msk           (_U_(0xFFFFFF) << PFW_IFT_CRCMLEN_CRCMLEN_Pos)       /**< (PFW_IFT_CRCMLEN)  Mask */
#define PFW_IFT_CRCMLEN_CRCMLEN(value)        (PFW_IFT_CRCMLEN_CRCMLEN_Msk & ((value) << PFW_IFT_CRCMLEN_CRCMLEN_Pos))
#define PFW_IFT_CRCMLEN_Msk                   _U_(0x00FFFFFF)                                      /**< (PFW_IFT_CRCMLEN) Register Mask  */


/* -------- PFW_IFT_CRCIV : (PFW Offset: 0x10) (R/W 32)  -------- */
#define PFW_IFT_CRCIV_RESETVALUE              _U_(0x00)                                            /**<  (PFW_IFT_CRCIV)   Reset Value */

#define PFW_IFT_CRCIV_CRCIV_Pos               _U_(0)                                               /**< (PFW_IFT_CRCIV)  Position */
#define PFW_IFT_CRCIV_CRCIV_Msk               (_U_(0xFFFFFFFF) << PFW_IFT_CRCIV_CRCIV_Pos)         /**< (PFW_IFT_CRCIV)  Mask */
#define PFW_IFT_CRCIV_CRCIV(value)            (PFW_IFT_CRCIV_CRCIV_Msk & ((value) << PFW_IFT_CRCIV_CRCIV_Pos))
#define PFW_IFT_CRCIV_Msk                     _U_(0xFFFFFFFF)                                      /**< (PFW_IFT_CRCIV) Register Mask  */


/* -------- PFW_IFT_CRCACC : (PFW Offset: 0x14) (R/W 32)  -------- */
#define PFW_IFT_CRCACC_RESETVALUE             _U_(0x00)                                            /**<  (PFW_IFT_CRCACC)   Reset Value */

#define PFW_IFT_CRCACC_CRCACC_Pos             _U_(0)                                               /**< (PFW_IFT_CRCACC)  Position */
#define PFW_IFT_CRCACC_CRCACC_Msk             (_U_(0xFFFFFFFF) << PFW_IFT_CRCACC_CRCACC_Pos)       /**< (PFW_IFT_CRCACC)  Mask */
#define PFW_IFT_CRCACC_CRCACC(value)          (PFW_IFT_CRCACC_CRCACC_Msk & ((value) << PFW_IFT_CRCACC_CRCACC_Pos))
#define PFW_IFT_CRCACC_Msk                    _U_(0xFFFFFFFF)                                      /**< (PFW_IFT_CRCACC) Register Mask  */


/* -------- PFW_IFT_CRCPOLY : (PFW Offset: 0x18) (R/W 32)  -------- */
#define PFW_IFT_CRCPOLY_RESETVALUE            _U_(0x00)                                            /**<  (PFW_IFT_CRCPOLY)   Reset Value */

#define PFW_IFT_CRCPOLY_CYCPOLY_Pos           _U_(0)                                               /**< (PFW_IFT_CRCPOLY)  Position */
#define PFW_IFT_CRCPOLY_CYCPOLY_Msk           (_U_(0xFFFFFFFF) << PFW_IFT_CRCPOLY_CYCPOLY_Pos)     /**< (PFW_IFT_CRCPOLY)  Mask */
#define PFW_IFT_CRCPOLY_CYCPOLY(value)        (PFW_IFT_CRCPOLY_CYCPOLY_Msk & ((value) << PFW_IFT_CRCPOLY_CYCPOLY_Pos))
#define PFW_IFT_CRCPOLY_Msk                   _U_(0xFFFFFFFF)                                      /**< (PFW_IFT_CRCPOLY) Register Mask  */


/* -------- PFW_IFT_CRCFXOR : (PFW Offset: 0x1C) (R/W 32)  -------- */
#define PFW_IFT_CRCFXOR_RESETVALUE            _U_(0x00)                                            /**<  (PFW_IFT_CRCFXOR)   Reset Value */

#define PFW_IFT_CRCFXOR_CRCFXOR_Pos           _U_(0)                                               /**< (PFW_IFT_CRCFXOR)  Position */
#define PFW_IFT_CRCFXOR_CRCFXOR_Msk           (_U_(0xFFFFFFFF) << PFW_IFT_CRCFXOR_CRCFXOR_Pos)     /**< (PFW_IFT_CRCFXOR)  Mask */
#define PFW_IFT_CRCFXOR_CRCFXOR(value)        (PFW_IFT_CRCFXOR_CRCFXOR_Msk & ((value) << PFW_IFT_CRCFXOR_CRCFXOR_Pos))
#define PFW_IFT_CRCFXOR_Msk                   _U_(0xFFFFFFFF)                                      /**< (PFW_IFT_CRCFXOR) Register Mask  */


/* -------- PFW_IFT_CRCSUM : (PFW Offset: 0x20) (R/W 32)  -------- */
#define PFW_IFT_CRCSUM_RESETVALUE             _U_(0x00)                                            /**<  (PFW_IFT_CRCSUM)   Reset Value */

#define PFW_IFT_CRCSUM_CRCSUM_Pos             _U_(0)                                               /**< (PFW_IFT_CRCSUM)  Position */
#define PFW_IFT_CRCSUM_CRCSUM_Msk             (_U_(0xFFFFFFFF) << PFW_IFT_CRCSUM_CRCSUM_Pos)       /**< (PFW_IFT_CRCSUM)  Mask */
#define PFW_IFT_CRCSUM_CRCSUM(value)          (PFW_IFT_CRCSUM_CRCSUM_Msk & ((value) << PFW_IFT_CRCSUM_CRCSUM_Pos))
#define PFW_IFT_CRCSUM_Msk                    _U_(0xFFFFFFFF)                                      /**< (PFW_IFT_CRCSUM) Register Mask  */


/* -------- PFW_IFT_ECCCON : (PFW Offset: 0x24) (R/W 32)  -------- */
#define PFW_IFT_ECCCON_RESETVALUE             _U_(0x00)                                            /**<  (PFW_IFT_ECCCON)   Reset Value */

#define PFW_IFT_ECCCON_FLT_MD_Pos             _U_(0)                                               /**< (PFW_IFT_ECCCON)  Position */
#define PFW_IFT_ECCCON_FLT_MD_Msk             (_U_(0x7) << PFW_IFT_ECCCON_FLT_MD_Pos)              /**< (PFW_IFT_ECCCON)  Mask */
#define PFW_IFT_ECCCON_FLT_MD(value)          (PFW_IFT_ECCCON_FLT_MD_Msk & ((value) << PFW_IFT_ECCCON_FLT_MD_Pos))
#define PFW_IFT_ECCCON_EVENT_Pos              _U_(7)                                               /**< (PFW_IFT_ECCCON)  Position */
#define PFW_IFT_ECCCON_EVENT_Msk              (_U_(0x1) << PFW_IFT_ECCCON_EVENT_Pos)               /**< (PFW_IFT_ECCCON)  Mask */
#define PFW_IFT_ECCCON_EVENT(value)           (PFW_IFT_ECCCON_EVENT_Msk & ((value) << PFW_IFT_ECCCON_EVENT_Pos))
#define PFW_IFT_ECCCON_CTLFLT_Pos             _U_(8)                                               /**< (PFW_IFT_ECCCON)  Position */
#define PFW_IFT_ECCCON_CTLFLT_Msk             (_U_(0x7) << PFW_IFT_ECCCON_CTLFLT_Pos)              /**< (PFW_IFT_ECCCON)  Mask */
#define PFW_IFT_ECCCON_CTLFLT(value)          (PFW_IFT_ECCCON_CTLFLT_Msk & ((value) << PFW_IFT_ECCCON_CTLFLT_Pos))
#define PFW_IFT_ECCCON_FLTEN_Pos              _U_(15)                                              /**< (PFW_IFT_ECCCON)  Position */
#define PFW_IFT_ECCCON_FLTEN_Msk              (_U_(0x1) << PFW_IFT_ECCCON_FLTEN_Pos)               /**< (PFW_IFT_ECCCON)  Mask */
#define PFW_IFT_ECCCON_FLTEN(value)           (PFW_IFT_ECCCON_FLTEN_Msk & ((value) << PFW_IFT_ECCCON_FLTEN_Pos))
#define PFW_IFT_ECCCON_Msk                    _U_(0x00008787)                                      /**< (PFW_IFT_ECCCON) Register Mask  */


/* -------- PFW_IFT_ECCFLT : (PFW Offset: 0x28) (R/W 32)  -------- */
#define PFW_IFT_ECCFLT_RESETVALUE             _U_(0x00)                                            /**<  (PFW_IFT_ECCFLT)   Reset Value */

#define PFW_IFT_ECCFLT_FLT1PTR_Pos            _U_(0)                                               /**< (PFW_IFT_ECCFLT)  Position */
#define PFW_IFT_ECCFLT_FLT1PTR_Msk            (_U_(0x1FF) << PFW_IFT_ECCFLT_FLT1PTR_Pos)           /**< (PFW_IFT_ECCFLT)  Mask */
#define PFW_IFT_ECCFLT_FLT1PTR(value)         (PFW_IFT_ECCFLT_FLT1PTR_Msk & ((value) << PFW_IFT_ECCFLT_FLT1PTR_Pos))
#define PFW_IFT_ECCFLT_FLT2PTR_Pos            _U_(16)                                              /**< (PFW_IFT_ECCFLT)  Position */
#define PFW_IFT_ECCFLT_FLT2PTR_Msk            (_U_(0x1FF) << PFW_IFT_ECCFLT_FLT2PTR_Pos)           /**< (PFW_IFT_ECCFLT)  Mask */
#define PFW_IFT_ECCFLT_FLT2PTR(value)         (PFW_IFT_ECCFLT_FLT2PTR_Msk & ((value) << PFW_IFT_ECCFLT_FLT2PTR_Pos))
#define PFW_IFT_ECCFLT_Msk                    _U_(0x01FF01FF)                                      /**< (PFW_IFT_ECCFLT) Register Mask  */


