Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/include/component/pfw.h
/* -------- PFW_IFT_ECCADR : (PFW Offset: 0x2C) (R/W 32)  -------- */
#define PFW_IFT_ECCADR_RESETVALUE             _U_(0x00)                                            /**<  (PFW_IFT_ECCADR)   Reset Value */

#define PFW_IFT_ECCADR_ECCADR_Pos             _U_(0)                                               /**< (PFW_IFT_ECCADR)  Position */
#define PFW_IFT_ECCADR_ECCADR_Msk             (_U_(0xFFFFFFFF) << PFW_IFT_ECCADR_ECCADR_Pos)       /**< (PFW_IFT_ECCADR)  Mask */
#define PFW_IFT_ECCADR_ECCADR(value)          (PFW_IFT_ECCADR_ECCADR_Msk & ((value) << PFW_IFT_ECCADR_ECCADR_Pos))
#define PFW_IFT_ECCADR_Msk                    _U_(0xFFFFFFFF)                                      /**< (PFW_IFT_ECCADR) Register Mask  */


/* -------- PFW_IFT_ECCPAR : (PFW Offset: 0x30) (R/W 32)  -------- */
#define PFW_IFT_ECCPAR_RESETVALUE             _U_(0x00)                                            /**<  (PFW_IFT_ECCPAR)   Reset Value */

#define PFW_IFT_ECCPAR_SECIN_Pos              _U_(0)                                               /**< (PFW_IFT_ECCPAR)  Position */
#define PFW_IFT_ECCPAR_SECIN_Msk              (_U_(0x1FF) << PFW_IFT_ECCPAR_SECIN_Pos)             /**< (PFW_IFT_ECCPAR)  Mask */
#define PFW_IFT_ECCPAR_SECIN(value)           (PFW_IFT_ECCPAR_SECIN_Msk & ((value) << PFW_IFT_ECCPAR_SECIN_Pos))
#define PFW_IFT_ECCPAR_DEDIN_Pos              _U_(15)                                              /**< (PFW_IFT_ECCPAR)  Position */
#define PFW_IFT_ECCPAR_DEDIN_Msk              (_U_(0x1) << PFW_IFT_ECCPAR_DEDIN_Pos)               /**< (PFW_IFT_ECCPAR)  Mask */
#define PFW_IFT_ECCPAR_DEDIN(value)           (PFW_IFT_ECCPAR_DEDIN_Msk & ((value) << PFW_IFT_ECCPAR_DEDIN_Pos))
#define PFW_IFT_ECCPAR_SECOUT_Pos             _U_(16)                                              /**< (PFW_IFT_ECCPAR)  Position */
#define PFW_IFT_ECCPAR_SECOUT_Msk             (_U_(0x1FF) << PFW_IFT_ECCPAR_SECOUT_Pos)            /**< (PFW_IFT_ECCPAR)  Mask */
#define PFW_IFT_ECCPAR_SECOUT(value)          (PFW_IFT_ECCPAR_SECOUT_Msk & ((value) << PFW_IFT_ECCPAR_SECOUT_Pos))
#define PFW_IFT_ECCPAR_DEDOUT_Pos             _U_(31)                                              /**< (PFW_IFT_ECCPAR)  Position */
#define PFW_IFT_ECCPAR_DEDOUT_Msk             (_U_(0x1) << PFW_IFT_ECCPAR_DEDOUT_Pos)              /**< (PFW_IFT_ECCPAR)  Mask */
#define PFW_IFT_ECCPAR_DEDOUT(value)          (PFW_IFT_ECCPAR_DEDOUT_Msk & ((value) << PFW_IFT_ECCPAR_DEDOUT_Pos))
#define PFW_IFT_ECCPAR_Msk                    _U_(0x81FF81FF)                                      /**< (PFW_IFT_ECCPAR) Register Mask  */


/* -------- PFW_IFT_ECCSYN : (PFW Offset: 0x34) (R/W 32)  -------- */
#define PFW_IFT_ECCSYN_RESETVALUE             _U_(0x00)                                            /**<  (PFW_IFT_ECCSYN)   Reset Value */

#define PFW_IFT_ECCSYN_SECSYN_Pos             _U_(0)                                               /**< (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_SECSYN_Msk             (_U_(0x1FF) << PFW_IFT_ECCSYN_SECSYN_Pos)            /**< (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_SECSYN(value)          (PFW_IFT_ECCSYN_SECSYN_Msk & ((value) << PFW_IFT_ECCSYN_SECSYN_Pos))
#define PFW_IFT_ECCSYN_DEDSYS_Pos             _U_(15)                                              /**< (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_DEDSYS_Msk             (_U_(0x1) << PFW_IFT_ECCSYN_DEDSYS_Pos)              /**< (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_DEDSYS(value)          (PFW_IFT_ECCSYN_DEDSYS_Msk & ((value) << PFW_IFT_ECCSYN_DEDSYS_Pos))
#define PFW_IFT_ECCSYN_SERR_Pos               _U_(16)                                              /**< (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_SERR_Msk               (_U_(0x1) << PFW_IFT_ECCSYN_SERR_Pos)                /**< (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_SERR(value)            (PFW_IFT_ECCSYN_SERR_Msk & ((value) << PFW_IFT_ECCSYN_SERR_Pos))
#define PFW_IFT_ECCSYN_DERR_Pos               _U_(17)                                              /**< (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_DERR_Msk               (_U_(0x1) << PFW_IFT_ECCSYN_DERR_Pos)                /**< (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_DERR(value)            (PFW_IFT_ECCSYN_DERR_Msk & ((value) << PFW_IFT_ECCSYN_DERR_Pos))
#define PFW_IFT_ECCSYN_CERR_Pos               _U_(18)                                              /**< (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_CERR_Msk               (_U_(0x1) << PFW_IFT_ECCSYN_CERR_Pos)                /**< (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_CERR(value)            (PFW_IFT_ECCSYN_CERR_Msk & ((value) << PFW_IFT_ECCSYN_CERR_Pos))
#define PFW_IFT_ECCSYN_CTLSTAT_Pos            _U_(24)                                              /**< (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_CTLSTAT_Msk            (_U_(0x7) << PFW_IFT_ECCSYN_CTLSTAT_Pos)             /**< (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_CTLSTAT(value)         (PFW_IFT_ECCSYN_CTLSTAT_Msk & ((value) << PFW_IFT_ECCSYN_CTLSTAT_Pos))
#define PFW_IFT_ECCSYN_PERR0_Pos              _U_(28)                                              /**< (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_PERR0_Msk              (_U_(0x1) << PFW_IFT_ECCSYN_PERR0_Pos)               /**< (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_PERR0(value)           (PFW_IFT_ECCSYN_PERR0_Msk & ((value) << PFW_IFT_ECCSYN_PERR0_Pos))
#define PFW_IFT_ECCSYN_PERR1_Pos              _U_(29)                                              /**< (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_PERR1_Msk              (_U_(0x1) << PFW_IFT_ECCSYN_PERR1_Pos)               /**< (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_PERR1(value)           (PFW_IFT_ECCSYN_PERR1_Msk & ((value) << PFW_IFT_ECCSYN_PERR1_Pos))
#define PFW_IFT_ECCSYN_PERR2_Pos              _U_(30)                                              /**< (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_PERR2_Msk              (_U_(0x1) << PFW_IFT_ECCSYN_PERR2_Pos)               /**< (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_PERR2(value)           (PFW_IFT_ECCSYN_PERR2_Msk & ((value) << PFW_IFT_ECCSYN_PERR2_Pos))
#define PFW_IFT_ECCSYN_PERR3_Pos              _U_(31)                                              /**< (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_PERR3_Msk              (_U_(0x1) << PFW_IFT_ECCSYN_PERR3_Pos)               /**< (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_PERR3(value)           (PFW_IFT_ECCSYN_PERR3_Msk & ((value) << PFW_IFT_ECCSYN_PERR3_Pos))
#define PFW_IFT_ECCSYN_Msk                    _U_(0xF70781FF)                                      /**< (PFW_IFT_ECCSYN) Register Mask  */

#define PFW_IFT_ECCSYN_PERR_Pos               _U_(28)                                              /**< (PFW_IFT_ECCSYN Position)  */
#define PFW_IFT_ECCSYN_PERR_Msk               (_U_(0xF) << PFW_IFT_ECCSYN_PERR_Pos)                /**< (PFW_IFT_ECCSYN Mask) PERR */
#define PFW_IFT_ECCSYN_PERR(value)            (PFW_IFT_ECCSYN_PERR_Msk & ((value) << PFW_IFT_ECCSYN_PERR_Pos)) 

/* -------- PFW_DFT_VALCON : (PFW Offset: 0x3C) (R/W 32)  -------- */
#define PFW_DFT_VALCON_RESETVALUE             _U_(0x00)                                            /**<  (PFW_DFT_VALCON)   Reset Value */

#define PFW_DFT_VALCON_VAL_ON_Pos             _U_(15)                                              /**< (PFW_DFT_VALCON)  Position */
#define PFW_DFT_VALCON_VAL_ON_Msk             (_U_(0x1) << PFW_DFT_VALCON_VAL_ON_Pos)              /**< (PFW_DFT_VALCON)  Mask */
#define PFW_DFT_VALCON_VAL_ON(value)          (PFW_DFT_VALCON_VAL_ON_Msk & ((value) << PFW_DFT_VALCON_VAL_ON_Pos))
#define PFW_DFT_VALCON_Msk                    _U_(0x00008000)                                      /**< (PFW_DFT_VALCON) Register Mask  */


/* -------- PFW_DFT_VALP1RR01 : (PFW Offset: 0x40) (R/W 32)  -------- */
#define PFW_DFT_VALP1RR01_RESETVALUE          _U_(0x00)                                            /**<  (PFW_DFT_VALP1RR01)   Reset Value */

#define PFW_DFT_VALP1RR01_PR1RR0_Pos          _U_(0)                                               /**< (PFW_DFT_VALP1RR01)  Position */
#define PFW_DFT_VALP1RR01_PR1RR0_Msk          (_U_(0xFFFF) << PFW_DFT_VALP1RR01_PR1RR0_Pos)        /**< (PFW_DFT_VALP1RR01)  Mask */
#define PFW_DFT_VALP1RR01_PR1RR0(value)       (PFW_DFT_VALP1RR01_PR1RR0_Msk & ((value) << PFW_DFT_VALP1RR01_PR1RR0_Pos))
#define PFW_DFT_VALP1RR01_P1RR1_Pos           _U_(16)                                              /**< (PFW_DFT_VALP1RR01)  Position */
#define PFW_DFT_VALP1RR01_P1RR1_Msk           (_U_(0xFFFF) << PFW_DFT_VALP1RR01_P1RR1_Pos)         /**< (PFW_DFT_VALP1RR01)  Mask */
#define PFW_DFT_VALP1RR01_P1RR1(value)        (PFW_DFT_VALP1RR01_P1RR1_Msk & ((value) << PFW_DFT_VALP1RR01_P1RR1_Pos))
#define PFW_DFT_VALP1RR01_Msk                 _U_(0xFFFFFFFF)                                      /**< (PFW_DFT_VALP1RR01) Register Mask  */


/* -------- PFW_DFT_VALP1RR23 : (PFW Offset: 0x44) (R/W 32)  -------- */
#define PFW_DFT_VALP1RR23_RESETVALUE          _U_(0x00)                                            /**<  (PFW_DFT_VALP1RR23)   Reset Value */

#define PFW_DFT_VALP1RR23_PR1RR2_Pos          _U_(0)                                               /**< (PFW_DFT_VALP1RR23)  Position */
#define PFW_DFT_VALP1RR23_PR1RR2_Msk          (_U_(0xFFFF) << PFW_DFT_VALP1RR23_PR1RR2_Pos)        /**< (PFW_DFT_VALP1RR23)  Mask */
#define PFW_DFT_VALP1RR23_PR1RR2(value)       (PFW_DFT_VALP1RR23_PR1RR2_Msk & ((value) << PFW_DFT_VALP1RR23_PR1RR2_Pos))
#define PFW_DFT_VALP1RR23_P1RR3_Pos           _U_(16)                                              /**< (PFW_DFT_VALP1RR23)  Position */
#define PFW_DFT_VALP1RR23_P1RR3_Msk           (_U_(0xFFFF) << PFW_DFT_VALP1RR23_P1RR3_Pos)         /**< (PFW_DFT_VALP1RR23)  Mask */
#define PFW_DFT_VALP1RR23_P1RR3(value)        (PFW_DFT_VALP1RR23_P1RR3_Msk & ((value) << PFW_DFT_VALP1RR23_P1RR3_Pos))
#define PFW_DFT_VALP1RR23_Msk                 _U_(0xFFFFFFFF)                                      /**< (PFW_DFT_VALP1RR23) Register Mask  */


