Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/include/component/pfw.h
/* -------- PFW_DFT_VALP1RR45 : (PFW Offset: 0x48) (R/W 32)  -------- */
#define PFW_DFT_VALP1RR45_RESETVALUE          _U_(0x00)                                            /**<  (PFW_DFT_VALP1RR45)   Reset Value */

#define PFW_DFT_VALP1RR45_PR1RR4_Pos          _U_(0)                                               /**< (PFW_DFT_VALP1RR45)  Position */
#define PFW_DFT_VALP1RR45_PR1RR4_Msk          (_U_(0xFFFF) << PFW_DFT_VALP1RR45_PR1RR4_Pos)        /**< (PFW_DFT_VALP1RR45)  Mask */
#define PFW_DFT_VALP1RR45_PR1RR4(value)       (PFW_DFT_VALP1RR45_PR1RR4_Msk & ((value) << PFW_DFT_VALP1RR45_PR1RR4_Pos))
#define PFW_DFT_VALP1RR45_P1RR5_Pos           _U_(16)                                              /**< (PFW_DFT_VALP1RR45)  Position */
#define PFW_DFT_VALP1RR45_P1RR5_Msk           (_U_(0xFFFF) << PFW_DFT_VALP1RR45_P1RR5_Pos)         /**< (PFW_DFT_VALP1RR45)  Mask */
#define PFW_DFT_VALP1RR45_P1RR5(value)        (PFW_DFT_VALP1RR45_P1RR5_Msk & ((value) << PFW_DFT_VALP1RR45_P1RR5_Pos))
#define PFW_DFT_VALP1RR45_Msk                 _U_(0xFFFFFFFF)                                      /**< (PFW_DFT_VALP1RR45) Register Mask  */


/* -------- PFW_DFT_VALP1RR67 : (PFW Offset: 0x4C) (R/W 32)  -------- */
#define PFW_DFT_VALP1RR67_RESETVALUE          _U_(0x00)                                            /**<  (PFW_DFT_VALP1RR67)   Reset Value */

#define PFW_DFT_VALP1RR67_PR1RR6_Pos          _U_(0)                                               /**< (PFW_DFT_VALP1RR67)  Position */
#define PFW_DFT_VALP1RR67_PR1RR6_Msk          (_U_(0xFFFF) << PFW_DFT_VALP1RR67_PR1RR6_Pos)        /**< (PFW_DFT_VALP1RR67)  Mask */
#define PFW_DFT_VALP1RR67_PR1RR6(value)       (PFW_DFT_VALP1RR67_PR1RR6_Msk & ((value) << PFW_DFT_VALP1RR67_PR1RR6_Pos))
#define PFW_DFT_VALP1RR67_P1RR7_Pos           _U_(16)                                              /**< (PFW_DFT_VALP1RR67)  Position */
#define PFW_DFT_VALP1RR67_P1RR7_Msk           (_U_(0xFFFF) << PFW_DFT_VALP1RR67_P1RR7_Pos)         /**< (PFW_DFT_VALP1RR67)  Mask */
#define PFW_DFT_VALP1RR67_P1RR7(value)        (PFW_DFT_VALP1RR67_P1RR7_Msk & ((value) << PFW_DFT_VALP1RR67_P1RR7_Pos))
#define PFW_DFT_VALP1RR67_Msk                 _U_(0xFFFFFFFF)                                      /**< (PFW_DFT_VALP1RR67) Register Mask  */


/* -------- PFW_DFT_VALP2RR01 : (PFW Offset: 0x50) (R/W 32)  -------- */
#define PFW_DFT_VALP2RR01_RESETVALUE          _U_(0x00)                                            /**<  (PFW_DFT_VALP2RR01)   Reset Value */

#define PFW_DFT_VALP2RR01_PR2RR0_Pos          _U_(0)                                               /**< (PFW_DFT_VALP2RR01)  Position */
#define PFW_DFT_VALP2RR01_PR2RR0_Msk          (_U_(0xFFFF) << PFW_DFT_VALP2RR01_PR2RR0_Pos)        /**< (PFW_DFT_VALP2RR01)  Mask */
#define PFW_DFT_VALP2RR01_PR2RR0(value)       (PFW_DFT_VALP2RR01_PR2RR0_Msk & ((value) << PFW_DFT_VALP2RR01_PR2RR0_Pos))
#define PFW_DFT_VALP2RR01_P2RR1_Pos           _U_(16)                                              /**< (PFW_DFT_VALP2RR01)  Position */
#define PFW_DFT_VALP2RR01_P2RR1_Msk           (_U_(0xFFFF) << PFW_DFT_VALP2RR01_P2RR1_Pos)         /**< (PFW_DFT_VALP2RR01)  Mask */
#define PFW_DFT_VALP2RR01_P2RR1(value)        (PFW_DFT_VALP2RR01_P2RR1_Msk & ((value) << PFW_DFT_VALP2RR01_P2RR1_Pos))
#define PFW_DFT_VALP2RR01_Msk                 _U_(0xFFFFFFFF)                                      /**< (PFW_DFT_VALP2RR01) Register Mask  */


/* -------- PFW_DFT_VALP2RR23 : (PFW Offset: 0x54) (R/W 32)  -------- */
#define PFW_DFT_VALP2RR23_RESETVALUE          _U_(0x00)                                            /**<  (PFW_DFT_VALP2RR23)   Reset Value */

#define PFW_DFT_VALP2RR23_PR2RR2_Pos          _U_(0)                                               /**< (PFW_DFT_VALP2RR23)  Position */
#define PFW_DFT_VALP2RR23_PR2RR2_Msk          (_U_(0xFFFF) << PFW_DFT_VALP2RR23_PR2RR2_Pos)        /**< (PFW_DFT_VALP2RR23)  Mask */
#define PFW_DFT_VALP2RR23_PR2RR2(value)       (PFW_DFT_VALP2RR23_PR2RR2_Msk & ((value) << PFW_DFT_VALP2RR23_PR2RR2_Pos))
#define PFW_DFT_VALP2RR23_P2RR3_Pos           _U_(16)                                              /**< (PFW_DFT_VALP2RR23)  Position */
#define PFW_DFT_VALP2RR23_P2RR3_Msk           (_U_(0xFFFF) << PFW_DFT_VALP2RR23_P2RR3_Pos)         /**< (PFW_DFT_VALP2RR23)  Mask */
#define PFW_DFT_VALP2RR23_P2RR3(value)        (PFW_DFT_VALP2RR23_P2RR3_Msk & ((value) << PFW_DFT_VALP2RR23_P2RR3_Pos))
#define PFW_DFT_VALP2RR23_Msk                 _U_(0xFFFFFFFF)                                      /**< (PFW_DFT_VALP2RR23) Register Mask  */


/* -------- PFW_DFT_VALP2RR45 : (PFW Offset: 0x58) (R/W 32)  -------- */
#define PFW_DFT_VALP2RR45_RESETVALUE          _U_(0x00)                                            /**<  (PFW_DFT_VALP2RR45)   Reset Value */

#define PFW_DFT_VALP2RR45_PR2RR4_Pos          _U_(0)                                               /**< (PFW_DFT_VALP2RR45)  Position */
#define PFW_DFT_VALP2RR45_PR2RR4_Msk          (_U_(0xFFFF) << PFW_DFT_VALP2RR45_PR2RR4_Pos)        /**< (PFW_DFT_VALP2RR45)  Mask */
#define PFW_DFT_VALP2RR45_PR2RR4(value)       (PFW_DFT_VALP2RR45_PR2RR4_Msk & ((value) << PFW_DFT_VALP2RR45_PR2RR4_Pos))
#define PFW_DFT_VALP2RR45_P2RR5_Pos           _U_(16)                                              /**< (PFW_DFT_VALP2RR45)  Position */
#define PFW_DFT_VALP2RR45_P2RR5_Msk           (_U_(0xFFFF) << PFW_DFT_VALP2RR45_P2RR5_Pos)         /**< (PFW_DFT_VALP2RR45)  Mask */
#define PFW_DFT_VALP2RR45_P2RR5(value)        (PFW_DFT_VALP2RR45_P2RR5_Msk & ((value) << PFW_DFT_VALP2RR45_P2RR5_Pos))
#define PFW_DFT_VALP2RR45_Msk                 _U_(0xFFFFFFFF)                                      /**< (PFW_DFT_VALP2RR45) Register Mask  */


/* -------- PFW_DFT_VALP2RR67 : (PFW Offset: 0x5C) (R/W 32)  -------- */
#define PFW_DFT_VALP2RR67_RESETVALUE          _U_(0x00)                                            /**<  (PFW_DFT_VALP2RR67)   Reset Value */

#define PFW_DFT_VALP2RR67_PR2RR6_Pos          _U_(0)                                               /**< (PFW_DFT_VALP2RR67)  Position */
#define PFW_DFT_VALP2RR67_PR2RR6_Msk          (_U_(0xFFFF) << PFW_DFT_VALP2RR67_PR2RR6_Pos)        /**< (PFW_DFT_VALP2RR67)  Mask */
#define PFW_DFT_VALP2RR67_PR2RR6(value)       (PFW_DFT_VALP2RR67_PR2RR6_Msk & ((value) << PFW_DFT_VALP2RR67_PR2RR6_Pos))
#define PFW_DFT_VALP2RR67_P2RR7_Pos           _U_(16)                                              /**< (PFW_DFT_VALP2RR67)  Position */
#define PFW_DFT_VALP2RR67_P2RR7_Msk           (_U_(0xFFFF) << PFW_DFT_VALP2RR67_P2RR7_Pos)         /**< (PFW_DFT_VALP2RR67)  Mask */
#define PFW_DFT_VALP2RR67_P2RR7(value)        (PFW_DFT_VALP2RR67_P2RR7_Msk & ((value) << PFW_DFT_VALP2RR67_P2RR7_Pos))
#define PFW_DFT_VALP2RR67_Msk                 _U_(0xFFFFFFFF)                                      /**< (PFW_DFT_VALP2RR67) Register Mask  */


/** \brief PFW register offsets definitions */
#define PFW_IFT_CON_REG_OFST           (0x00)              /**< (PFW_IFT_CON)  Offset */
#define PFW_IFT_CRCCON_REG_OFST        (0x04)              /**< (PFW_IFT_CRCCON)  Offset */
#define PFW_IFT_CRCMADR_REG_OFST       (0x08)              /**< (PFW_IFT_CRCMADR)  Offset */
#define PFW_IFT_CRCMLEN_REG_OFST       (0x0C)              /**< (PFW_IFT_CRCMLEN)  Offset */
#define PFW_IFT_CRCIV_REG_OFST         (0x10)              /**< (PFW_IFT_CRCIV)  Offset */
#define PFW_IFT_CRCACC_REG_OFST        (0x14)              /**< (PFW_IFT_CRCACC)  Offset */
#define PFW_IFT_CRCPOLY_REG_OFST       (0x18)              /**< (PFW_IFT_CRCPOLY)  Offset */
#define PFW_IFT_CRCFXOR_REG_OFST       (0x1C)              /**< (PFW_IFT_CRCFXOR)  Offset */
#define PFW_IFT_CRCSUM_REG_OFST        (0x20)              /**< (PFW_IFT_CRCSUM)  Offset */
#define PFW_IFT_ECCCON_REG_OFST        (0x24)              /**< (PFW_IFT_ECCCON)  Offset */
#define PFW_IFT_ECCFLT_REG_OFST        (0x28)              /**< (PFW_IFT_ECCFLT)  Offset */
#define PFW_IFT_ECCADR_REG_OFST        (0x2C)              /**< (PFW_IFT_ECCADR)  Offset */
#define PFW_IFT_ECCPAR_REG_OFST        (0x30)              /**< (PFW_IFT_ECCPAR)  Offset */
#define PFW_IFT_ECCSYN_REG_OFST        (0x34)              /**< (PFW_IFT_ECCSYN)  Offset */
#define PFW_DFT_VALCON_REG_OFST        (0x3C)              /**< (PFW_DFT_VALCON)  Offset */
#define PFW_DFT_VALP1RR01_REG_OFST     (0x40)              /**< (PFW_DFT_VALP1RR01)  Offset */
#define PFW_DFT_VALP1RR23_REG_OFST     (0x44)              /**< (PFW_DFT_VALP1RR23)  Offset */
#define PFW_DFT_VALP1RR45_REG_OFST     (0x48)              /**< (PFW_DFT_VALP1RR45)  Offset */
#define PFW_DFT_VALP1RR67_REG_OFST     (0x4C)              /**< (PFW_DFT_VALP1RR67)  Offset */
#define PFW_DFT_VALP2RR01_REG_OFST     (0x50)              /**< (PFW_DFT_VALP2RR01)  Offset */
#define PFW_DFT_VALP2RR23_REG_OFST     (0x54)              /**< (PFW_DFT_VALP2RR23)  Offset */
#define PFW_DFT_VALP2RR45_REG_OFST     (0x58)              /**< (PFW_DFT_VALP2RR45)  Offset */
#define PFW_DFT_VALP2RR67_REG_OFST     (0x5C)              /**< (PFW_DFT_VALP2RR67)  Offset */

