Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/include/component/pfw.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PFW register API structure */
typedef struct
{  /* flash wrapper */
  __IO  uint32_t                       PFW_IFT_CON;        /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_CRCCON;     /**< Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_CRCMADR;    /**< Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_CRCMLEN;    /**< Offset: 0x0C (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_CRCIV;      /**< Offset: 0x10 (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_CRCACC;     /**< Offset: 0x14 (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_CRCPOLY;    /**< Offset: 0x18 (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_CRCFXOR;    /**< Offset: 0x1C (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_CRCSUM;     /**< Offset: 0x20 (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_ECCCON;     /**< Offset: 0x24 (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_ECCFLT;     /**< Offset: 0x28 (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_ECCADR;     /**< Offset: 0x2C (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_ECCPAR;     /**< Offset: 0x30 (R/W  32)  */
  __IO  uint32_t                       PFW_IFT_ECCSYN;     /**< Offset: 0x34 (R/W  32)  */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       PFW_DFT_VALCON;     /**< Offset: 0x3C (R/W  32)  */
  __IO  uint32_t                       PFW_DFT_VALP1RR01;  /**< Offset: 0x40 (R/W  32)  */
  __IO  uint32_t                       PFW_DFT_VALP1RR23;  /**< Offset: 0x44 (R/W  32)  */
  __IO  uint32_t                       PFW_DFT_VALP1RR45;  /**< Offset: 0x48 (R/W  32)  */
  __IO  uint32_t                       PFW_DFT_VALP1RR67;  /**< Offset: 0x4C (R/W  32)  */
  __IO  uint32_t                       PFW_DFT_VALP2RR01;  /**< Offset: 0x50 (R/W  32)  */
  __IO  uint32_t                       PFW_DFT_VALP2RR23;  /**< Offset: 0x54 (R/W  32)  */
  __IO  uint32_t                       PFW_DFT_VALP2RR45;  /**< Offset: 0x58 (R/W  32)  */
  __IO  uint32_t                       PFW_DFT_VALP2RR67;  /**< Offset: 0x5C (R/W  32)  */
} pfw_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ25_PFW_COMPONENT_H_ */
